software-engineering-starter-web.html
---
layout: default
title: Software Engineering - Starter Web app
date: 2018-06-13
categories: software-engineering
---

<p>
Hi there! I believe questions are wonderful opportunities to enhance
documentation. In this case I&rsquo;ve put together a series of posts for putting
together your first web application using this buzzword list: HTML, CSS,
Node.js, Express.js, bash (or just a shell), yarn, git, Homebrew, and maybe some
other stuff I forgot to include.
</p>

<ul class="org-ul">
<li><a href="./software-engineering-starter-web-01.html">part 1 - getting set up with your local environment, and a tiny server</a></li>
<li><a href="./software-engineering-starter-web-02.html">part 2 - using curl, mime types, and fulfilling an automated test</a></li>
<li><a href="./software-engineering-starter-web-03.html">part 3 - working with data</a></li>
<li><a href="./software-engineering-starter-web-04.html">part 4 - backing it all up with git</a></li>
</ul>

<p>
While this isn&rsquo;t complete, I&rsquo;ll expand upon it anytime I get a chance to help
someone pick up the trade. Don&rsquo;t worry if it seems like a lot! Fairly consistent
exposure will keep you moving along the never-ending fractal that is learning
about software engineering.
</p>
